import { Component } from '@angular/core';
import { AccordionItem } from '../../shared/interfaces/accordionItem/accordion-item';
import { ReuseComponent } from "../../shared/components/reuse/reuse.component";

@Component({
  selector: 'app-about',
  imports: [ReuseComponent],
  templateUrl: './about.component.html',
  styleUrl: './about.component.scss'
})
export class AboutComponent {
title: string = 'اكوا جارد هي';
aboutSection = {
  title: 'من هي أكوا جارد',
  paragraphs: [
    '✨ رؤيتنا تتجسد في كل قطرة مياه… وإبداعنا بلا حدود.',
    '🏗 أكوا جارد شركة رائدة ومتخصصة في تصميم وتنفيذ المنشآت المائية والنوادي الصحية، نقدم حلولًا متكاملة تجمع بين الجمال، الرفاهية، وأعلى معايير الأمان.',
    '🌿 نحن لا نبني فقط، بل نصنع مساحات استرخاء مميزة تُنفذ بدقة وجودة عالية.',
    '🛠 خدماتنا',
    '🏊‍♂️ حمامات سباحة — جميع الأنواع (Skimmer – Overflow – Infinity).',
    '💆‍♀️ نوادي صحية (Spa) — ساونا، بخار، جاكوزي بأحدث التقنيات.',
    '🌊 لاندسكيب مائي — شلالات صناعية ونوافير راقصة.',
    '🏞 منشآت مائية متخصصة — بحيرات صناعية وخزانات ومحطات معالجة.',
    '⭐ لماذا أكوا جارد؟',
    '👷‍♂️ كوادر هندسية محترفة بخبرة عالية.',
    '🌍 خامات ومعدات عالمية.',
    '🛡 ضمان شامل 10 سنوات.',
    '🔧 خدمات ما بعد التنفيذ.',
    '💎 دقة في التنفيذ … أمان في الاستخدام … رفاهية تدوم.'
  ]
};

accordionItems: AccordionItem[] = [
  {
    title: 'شلالات ونوافير وأكوا بارك ',
    content: ' خبرة ستصل بنا الى تحقيق كل ما يتمناه العميل...',
    open: false
  },
  {
    title: 'حمامات السباحة',
    content: 'تصميم وتنفيذ جميع انواع حمامات السباحة...',
    open: false
  },
  {
    title: 'صيانة بيع المعدات',
    content: `وفر جميع المعدات من افضل الماركات العالمية كما يوجد قسم لصيانة المعدات `,
    open: false
  },
  {
    title: 'احلال وتجديد المنشآت.',
    content: 'نوفر احلال وتجديد المنشآت ضد عيوب التنفيذ أو بعد انتهاء العمر الافتراضي ',
    open: false
  }
  ,
  {
    title: 'خدمة العملاء ',
    content: 'نحن نمنحك ضماناً قويا  وخدمة ما بعد التسليم تضع رضاك فوق كل اعتبار.',
    open: false
  }
];
toggleItem(index: number) {
  this.accordionItems[index].open =
    !this.accordionItems[index].open;
}
}
