import { Component } from '@angular/core';

@Component({
  selector: 'app-feature',
  imports: [],
  templateUrl: './feature.component.html',
  styleUrl: './feature.component.scss'
})
export class FeatureComponent {

  features = [
    {
      id: 1,
      title: 'حمامات سباحة عامة',
      description:
        'تنفيذ المشروعات الكبرى للفنادق والكمبوندات والنوادي الرياضية، مع الالتزام التام بمعايير السلامة العالمية وأنظمة الفلترة والتعقيم.'
    },
    {
      id: 2,
      title: 'حمامات سباحة خاصة',
      description:
        'تصاميم عصرية تناسب مساحة حديقتك، مع أنظمة تعقيم وإضاءة ذكية لتوفير خصوصية وراحة تامة.'
    },
    {
      id: 3,
      title: 'الشلالات والنوافير والاكوا بارك ',
      description:
       `إضافة روح وحيوية للمكان من خلال حركة المياه وانسيابها بشكل جذاب.
تصميم وتنفيذ شلالات صناعية تحاكي الطبيعة، ونوافير ثابتة أو راقصة بأشكال مبتكرة مزودة بإضاءة LED حديثة، مع توريد وتركيب الألعاب المائية من أفضل موردي الفايبر جلاس المتخصصين.`
    },
    {
      id: 4,
      title: 'النوادي الصحية والاسبا ',
      description:
        `نحن ننشئ ملاذك الخاص للاسترخاء بأحدث التقنيات.
تجهيز غرف الساونا والبخار.
تصميم وتنفيذ وحدات الجاكوزي (Jacuzzi) المخصصة.
تجهيز المسارات المائية والمغطس البارد للنوادي الصحية الاحترافية.`
    }
  ];

}
